In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('main.csv')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
df = df.groupby(['occupation']).describe()['age'].loc[:,['min', 'max']]

In [5]:
df_output = df.astype('int')

In [6]:
df_output.to_csv('2.csv')